import { useEffect, useState } from 'react'
import '../Page.scss'
import { useStorage } from '../../providers/StorageProvider'

export const About = () => {
  return (
    <div className='page' id='about'>
        <section id="about">
            <h1>Про проєкт</h1>
            <p>
                Цей проєкт є демонстраційною версією, створеною для захисту практики та подальшого вдосконалення. 
                Наразі проєкт знаходиться на стадії розробки, і в майбутньому буде значно розширено його функціонал.
            </p> <br />
            <p>У наступних версіях планується реалізація:</p> <br />
            <ol>
                <li><strong>Авторизації та особистого кабінету</strong> для кожного користувача.</li>
                <li><strong>Унікального дашборду</strong>, що адаптується під потреби користувачів та адміністраторів.</li> 
                <li>Інтеграції <strong>бекенду та баз даних</strong> для зберігання та обробки даних у реальному часі.</li> 
                <li>Додавання <strong>нових функцій</strong>, які зроблять проєкт ще зручнішим і функціональнішим.</li> <br /> 
            </ol> <br />
            <p>
                Ми прагнемо створити продукт, який буде корисним для ресторану "МАО" та його команди. Подальша робота над цим проєктом вже запланована, 
                і він буде активно розвиватися.
            </p> <br />
            <p>Дякуємо за підтримку та інтерес до проєкту! Ваші відгуки допоможуть нам зробити його ще кращим.</p>
            <p>Для зв'язку з нами пишіть на <a href="mailto:olegnckdev@gmail.com">olegnckdev@gmail.com</a>.</p>
        </section>

    </div>
  )

}
